Tekla Open API Reference for Tekla Structures 2025
DetailMark.DetailMarkAttributes Constructor (String)
 Creates a new DetailMarkAttributes instance that loads the specified attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DetailMarkAttributes(
	string attributesFile
)
Public Sub New (
	attributesFile As String
)
Parameters
attributesFile
Type: System.String
The attributes file's filename.
See Also
Reference
DetailMark.DetailMarkAttributes Class
DetailMark.DetailMarkAttributes Overload
Tekla.Structures.Drawing Namespace